app/Controllers/Dashboard.php

    public function index()
    {
        $builder = $this->db->table('user');
        $builder->select('*, user.name as user_name, role.name as role_name');
        $builder->join('role', 'role.id = user.id_role');
        $builder->where('user.id', session()->get('id'));
        $query = $builder->get()->getRow();
---
SELECT *, `user`.`name` as `user_name`, `role`.`name` as `role_name`
FROM `user`
JOIN `role` ON `role`.`id` = `user`.`id_role`
WHERE `user`.`id` = '2'